{"part-1": "John, Rose, Dave, and Jade are online friends. On John’s thirteenth birthday, the kids play a game that takes them and their guardians to a set of fantastic worlds called the Medium. They are challenged to work together, kill monsters, learn punch-card alchemy, and build their houses up to the heavenly orb of Skaia.\nIn their dreams, John and Jade have dreamselves that live on Prospit, which neighbours and defends Skaia. Rose and Dave’s dreamselves live on Derse, which attacks Skaia from beyond the Veil, an asteroid belt.\nArchagent Jack Noir of Derse emerges as the villain of the game after killing his own queen and king and terrorizing the Battlefield in Skaia. The key to Noir’s rise, and at one point the only check on his power, is a heavily-armed robot bunny siezed by Derse on its way from Jade to John.\nJack Noir defeats Prospit, kills Dream Jade, and shoots meteors at Skaia.\nSkaia sends the meteors through portals to strike Earth instead. The redirected meteors cause a Reckoning that wipes out life on Earth. But the portals also send people to different times on Earth: paradox-cloned babies who grow up to be the kids and their ancestors before the Reckoning, a group of exiles after the Reckoning, and a doglike First Guardian who is now Jade’s pet.\nSome strangers have been trolling the kids, claiming to be from another universe and another game session. These trolls say they have seen that the kids will fail and die.\nIn the Intermission, Spades Slick and the Midnight Crew fight their rivals The Felt. The Midnight Crew turn out to be exiles from the trolls’ game.\nBy the end of Part 1, Jade still hasn’t entered the Medium and the kids still don’t know the point of the game.", "part-2": "Aradia, Tavros, Sollux, Karkat, Nepeta, Kanaya, Terezi, Vriska, Equius, Gamzee, Eridan, and Feferi are trolls from Alternia. They play a game like the one the kids played. They paradox-clone themselves and their ancestors, defeat the Black King, and perform the Ultimate Alchemy. But before they can claim the ultimate reward, an invincible demon appears and destroys the doorway into the universe they have created. The trolls flee to a laboratory in the Veil while the demon goes around blowing up their planets.\nWhile hiding in the Veil, the trolls make contact with the human kids, who lived in the universe the trolls created. The trolls can see the kids’ whole lives up to a point. When they figure out who the demon is—Jack Noir, powered up by Jade’s entry choices—the trolls blame the kids for their current crisis. They believe the kids will cause a “scratch” that sends Noir to the troll session. But Noir will murder the rest of the kids’ parents before he is banished.\nThe scratch is a way for players to erase a failing game session and start over, letting their cloned parents play instead. The trolls unknowingly played after a scratch done by their own ancestors. In the bargain they got the First Guardian Doc Scratch, servant of Lrd English.\nThe kids progress mostly on the game’s terms, except for Rose, who addresses the session’s preordained failure instead. Doc Scratch talks Rose into scratching the session and bombing the source of the First Guardians’ power, the Green Sun, to weaken Jack Noir.\nAll the kids get involved in the puppet’s ruse. Carrying a Tumor dug out of Skaia’s Battlefield, Rose and Dave fly out into the space beyond game sessions, the Furthest Ring. The Tumor uses the destruction of two universes to create the Green Sun. Jade makes the Genesis Frog that could become a new universe once they find a more fertile Skaia. John initiates the scratch. Jade and John escape through a portal to the new session. The scratch erases the old session. By this time, the kids have all died twice and risen up to the god tiers.\nJack Noir escapes the scratch by exiling himself first to Earth and then to the troll session. His rampage ends with the murder of the troll-made Genesis Frog which contains the kids’ universe. Along the way, Noir kills some of the other exiles. Their leader, the Prospitian Monarch, swears revenge. She finds the twin of Noir’s ring, puts it on, matches him in power, and follows him to the troll session.\nThe Condesce, her empire of trolls wiped out, kills Lrd English’s Handmaid and takes her job. She goes to serve English in another universe. Doc Scratch makes the troll session’s archagent Spades Slick pocket the eight ball of The Felt, ending the troll universe and Scratch’s life. English is summoned into their remains.\nTempers flare in the Veil where the trolls are holed up. Some of them kill each other, one explodes, and one kills himself propelling the laboratory meteor out toward the Green Sun. Karkat, Kanaya, Terezi, and Gamzee are the only survivors on the meteor, although Aradia is alive in the bubbles of the Furthest Ring where dead players and dreamselves dream.", "part-3": "In the first session, Skaia sent the cloned babies to grow up on Earth as the guardians and kids who played in that session. When they scratched and reset it, Skaia switched their arrivals on Earth, making the kids be the guardians and vice versa. The history of Earth diverged when it was seeded with GCat instead of Becquerel.\nThe troll Condesce has infiltrated post-scratch Earth and the Medium. On Earth, she poses as Betty Crocker on her way to world domination. On Derse, she usurps the Black Queen. She has her agents demolish the Battlefield and try to assassinate the dreamselves.\nJane, Jake, Roxy, and Dirk are the four kids who play the post-scratch “alpha” version of Sburb. On Earth, Jane and Jake take the place of John and Jade, but Roxy and Dirk are displaced in time. They grow up four centuries in the future, the only two humans left on Earth.\nThe alpha session is even more void of promise than the scratched one. The kids enter with unprototyped sprites, making the Ultimate Alchemy impossible. Their planets inert, their consorts dead on arrival, they must wait for other players to arrive and restore the session’s potential.\nThe pre-scratch kids and surviving trolls have a long voyage to the alpha session. Jade and John fly their battleship through the Author’s apartment for three years. And for those same three years, Rose, Dave, and the trolls fly their asteroid through the Furthest Ring, passing through dream bubbles and meeting the ghosts of their Beforan precursors. They are followed the whole way by Bec Noir and the Prospitian Monarch.\nIn his dreams, John finds a Ring of Life and gets involved in a dream bubble treasure hunt. The ghosts of Vriska, Aranea, and Meenah are looking for a weapon that will defeat Lrd English, who is himself hunting for the ghost of his sister. The pirates find a house-shaped hole in canon. John puts his hand through the hole and gains a canon-hopping hiccup, teleporting involuntarily from scene to scene.\nLrd English was once the cherub Caliborn, who shared a body with another personality, Calliope. They were raised in infancy by Gamzee and grew up in contact with the alpha kids. After killing Calliope, Caliborn played a dead solo game of Sburb. He chose the path of constant conquest and received godly powerups for defeating his denizen Yaldabaoth. Now he roams the Furthest Ring, popping dream bubbles with his ghost-killing breath. He also murders the Author, who had rescued Spades Slick from the dying troll universe.\nSlick resurrects English’s leprechaun gang The Felt and leads them toward the post-scratch session. He will not find English there, but there is an avatar of his, a Jack Noir cursed with English’s madness and pool ball eyes. This Jack kills Jane and Jake in their quest crypt while the Condesce kills Roxy and Dirk in theirs. The alpha kids rise up to godhood.\nAs soon as Jade arrives in the Medium, the Condesce hypnotizes Jade and Jane. They become Condy’s servants and take control of the session. They imprison Jake and Roxy, banish Dirk, and dump the other arriving players at John’s feet. It is the first time John has met the others in person.\nHomestuck runs out of discs. In Part 4, Caliborn will replace Homestuck with the story he wants to tell.", "part-4": "Caliborn seizes control of the narrative. He replaces Homestuck with his own twisted version, \"Homosuck,\" mocking the story and its creator. Caliborn's aim is to undermine and ridicule everything, from the protagonist's struggles to the art itself. Despite his effort to hijack the narrative, Caliborn unwittingly contributes to the story's continuation, as items left by The Author lead him to unlock new content, extending Homestuck even as he tries to derail it.\n\nIn the main narrative, the players have just arrived to the new session. The scattered kids face challenges under the Condesce's plan to take over their session and its nascent Universe, with Jade and Jane falling under her control, and Jake, Roxy and Dirk imprisoned or otherwise AWOL. \n\nAranea uses the Ring of Life juju to come back to life. After a massive battle, where most characters die due to the Condesce and Aranea's meddling, John meets his Denizen in desperation, and gains a power to jump across the canon of the narrative itself. Directed by a dying Terezi's instructions, John \"retcons\" events so that Vriska survives instead of dying. Vriska takes an active role in helping the group strategize for the upcoming showdown.\n\nIn the final ACT ACT ACT, Caliborn shows a \"spoiler to the ending of things\" in Claymation form. In his tale, eight kids show up to defeat him, and four of them (which seem to be some version of John, Rose, Dave and Jade) are trapped inside a house-shaped juju. The four remaining combatants, implied to be the Alpha Kids, cause the ultimate defeat of Caliborn, but also the creation of Lord English. The ultimate villain is revealed to be a product of the combined essences of Caliborn, Arquiusprite, and Gamzee, created as an unwitting side effect of one Dirk's attack. A combination of their souls is trapped inside the Lil Cal juju, which is (only temporally, as we've previously seen) sent into the Void by one Roxy.\n\nIn the present time and session, and with proper planning, an even more intense battle ensues. It involves all of the main players, Spades Slick, Lord Jack, and The Condesce. Roxy manages to land a killing blow on The Condesce, and Dave and Dirk defeat the Jacks. Avoiding all casualties, the players reunite at the victory lilypad, where Calliope is resurrected, finally able to take her place in the waking world.\n\nAfter a long sequence of post-battle conversations, the players use the power of the Forge and the Genesis Frog create a new universe, Universe C. In the Furthest Ring, the alternate Calliope, the Muse of Space, helps collapse the Green Sun into a Black Hole, where Vriska deploys the secret weapon against Lord English, a house-shaped juju, but his defeat is not shown.\n\nThe surviving players and their allies pass through the door to claim the Ultimate Reward: a new world for themselves, where the previous Earth B (now C) is placed and prepared to support new life. The players are crowned as the creators of this new universe, and they begin to rebuild civilization. The story concludes with a hint that John still needs to return to finish the job and defeat Caliborn, a closed loop that will end with Lord English's creation."}